#include <reg51.h>
#include <stdio.h>


#define uchar unsigned char
#define ulint unsigned long int
#define L 5.0 //ÏàÁÚÁ½ºìÍâ´«¸ÐÆ÷¼äµÄ¾àÀë


//----------------------------------------------------------------------------------------------------------------------------
//Òý½Å¶¨Òå
//----------------------------------------------------------------------------------------------------------------------------


//½ÓÊÜºìÍâ´«¸ÐÄ£¿éÊä³öÐÅºÅµÄÒý½Å
sbit key1=P3^2;//Ä£¿é1,int0ÏÂ½µÑØÖÐ¶Ï
sbit key2=P3^3;//Ä£¿é2,int1ÏÂ½µÑØÖÐ¶Ï
sbit key3=P2^2;//Ä£¿é3,io¿ÚP2.2£¬¸ÐÓ¦µ½ÎïÌåÊ±Ä£¿éÊä³öµÍµçÆ½£¬·ñÔòÎª¸ßµçÆ½

//--------------------------------------------------------------------------------------------------------------------

//LEDµÆ£¬Ã¿¸öºìÍâÄ£¿éÏìÓ¦Ê±¶ÔÓ¦µÄÖ¸Ê¾µÆÁÁ

//blue lights
sbit led11=P1^7;//11
sbit led12=P1^6;//12

//yellow lights
sbit led21=P1^5;//21
sbit led22=P1^4;//22

//green lights
sbit led31=P1^3;//31
sbit led32=P1^2;//32


//--------------------------------------------------------------------------------------------------------------------

//LCDÆÁ½Ó¿Ú¶¨Òå
sbit RS=P1^0;//¼Ä´æÆ÷Ñ¡ÔñÎ»£¬1ÎªÑ¡ÔñÊý¾Ý¼Ä´æÆ÷£¬0ÎªÑ¡ÔñÖ¸Áî¼Ä´æÆ÷
sbit RW=P1^1;//¶ÁÐ´ÐÅºÅÎ»£¬1Îª¶Á²Ù×÷£¬0ÎªÐ´²Ù×÷
sbit EN=P2^5;//Ê¹ÄÜÎ»£¬¸ßµçÆ½Ê¹ÄÜ


//·äÃùÆ÷Òý½Å
sbit beep=P2^3;//·äÃùÆ÷

//----------------------------------------------------------------------------------------------------------------------------
//±äÁ¿¶¨Òå
//----------------------------------------------------------------------------------------------------------------------------


//µÚÒ»¶ÎÊ±¼ätime0£¬µÚ¶þ¶ÎÊ±¼ätime1
static ulint time0,time1;

//¼ÆÊ±Æ÷0£¬¼ÆÊ±Æ÷1Òç³ö´ÎÊýcount0£¬count1
static ulint count0=0,count1=0;

//ºìÍâ¸ÐÓ¦Ä£¿éÏìÓ¦±êÖ¾£¬Èô¸ÐÓ¦µ½ÎïÌåÔò¸ÃÄ£¿é×´Ì¬±êÖ¾ÖÃ1
static	ulint state1,state2,state3;


//----------------------------------------------------------------------------------------------------------------------------
//º¯ÊýÉùÃ÷
//----------------------------------------------------------------------------------------------------------------------------


void delay(ulint n);//ÑÓÊ±

void int0initial(void);//int0³õÊ¼»¯

void int1initial(void);//int1³õÊ¼»¯

void time0initial(void);//time0³õÊ¼»¯

void time1initial(void);//time1³õÊ¼»¯

void lcdwritedata(uchar dat);//LCDÆÁÐ´Êý¾Ý

void lcdwritecmd(uchar cmd);//LCDÆÁÐ´Ö¸Áî

void lcdinitial(void);//LCDÆÁ³õÊ¼»¯

void lcddisplay(uchar x, uchar y, uchar *str);//LCDÆÁ×ÛºÏÏÔÊ¾º¯Êý

void time0reset(void);//time0¸´Î»
	
void time1reset(void);//time1¸´Î»


//----------------------------------------------------------------------------------------------------------------------------
//º¯Êý¶¨Òå
//----------------------------------------------------------------------------------------------------------------------------


//ÑÓÊ±º¯Êý,n=1ÑÓÊ±1ms
void delay(ulint n)
{
	ulint i,j;
	for(i=n;i>0;i--)
	{
		for(j=110;j>0;j--);
	}
}



//Íâ²¿ÖÐ¶Ïint0³õÊ¼»¯
void int0initial(void)
{
	IT0=1;//ÏÂ½µÑØ´¥·¢
	EX0=1;//Íâ²¿ÖÐ¶Ï0ÔÊÐí
	EA=1;//¿ª×ÜÖÐ¶Ï
	PX0=0;//INT0µÍÓÅÏÈ¼¶
}



//Íâ²¿ÖÐ¶Ïint1³õÊ¼»¯
void int1initial(void)
{
	IT1=1;
	EX1=1;
	EA=1;
	PX1=1;//INT1¸ßÓÅÏÈ¼¶
}



//time0³õÊ¼»¯
void time0initial()
{
	TMOD=0x11;//¶¨Ê±Æ÷0ºÍ1¶¼Îª¹¤×÷·½Ê½1
	TH0=0;
	TL0=0;//TH,TL³õÖµ¶¼Îª0
	TR0=0;//¼ÆÊ±Æ÷¹Ø±Õ
	EA=1;//¿ª×ÜÖÐ¶Ï
	ET0=1;//ÔÊÐítime0ÖÐ¶Ï
	PT0=0;//T0µÍÓÅÏÈ¼¶
}



//time1³õÊ¼»¯
void time1initial()
{
	TMOD=0x11;//¶¨Ê±Æ÷0ºÍ1¶¼Îª¹¤×÷·½Ê½1
	TH1=0;
	TL1=0;
	TR1=0;
	EA=1;
	ET1=1;
	PT1=1;//T1¸ßÓÅÏÈ¼¶
}



//LCDÆÁÐ´Êý¾Ý
void lcdwritedata(uchar dat)
{
	RS=1;//Ñ¡ÔñÊý¾Ý¼Ä´æÆ÷
	P0=dat;//P0 IO¿Ú½ÓLCDÆÁÊý¾Ý¿Ú
	delay(2);
	EN=1;
	delay(2);
	EN=0;
}



//LCDÆÁÐ´Ö¸Áî
void lcdwritecmd(uchar cmd)
{
	RS=0;//Ñ¡ÔñÖ¸Áî¼Ä´æÆ÷
	P0=cmd;
	delay(2);
	EN=1;
	delay(2);
	EN=0;
}



//LCDÆÁ³õÊ¼»¯
void lcdinitial(void)
{
	RW=0;//Ð´²Ù×÷
	lcdwritecmd(0x38);//ÆÁÄ»³õÊ¼»¯
	lcdwritecmd(0x0c);//´ò¿ªÏÔÊ¾£¬¹Ø±Õ¹â±ê
	lcdwritecmd(0x06);//Ã¿¶Á»òÐ´Ò»¸ö×Ö·û£¬Ö¸ÕëºóÒÆÒ»Î»
	lcdwritecmd(0x01);//ÇåÆÁ
	lcdwritecmd(0x80);//ÉèÖÃ×Ö·ûÏÔÊ¾Î»ÖÃ
}



//LCDÆÁ×ÛºÏÏÔÊ¾º¯Êý
//´ÓµÚyÐÐ£¬µÚxÁÐ¿ªÊ¼Ð´str×Ö·û´®
void lcddisplay(uchar x, uchar y, uchar* str)
{
	uchar addr;
	
	if(y==0)
	{
		addr=0x00+x;//µÚÒ»ÐÐµÄxÎ»ÖÃ¿ªÊ¼ÏÔÊ¾
	}
	else
	{
		addr=0x40+x;//µÚ¶þÐÐµÄxÎ»ÖÃ¿ªÊ¼ÏÔÊ¾
	}
	lcdwritecmd(addr+0x80);
	while(*str!='\0')
	{
		lcdwritedata(*str++);
	}
}



//¶¨Ê±Æ÷0¸´Î»º¯Êý
void time0reset(void)
{
	TH0=0;
	TL0=0;//TH,TL³õÖµÖÃ0
	count0=0;//Òç³ö´ÎÊýÇå0
}



//¶¨Ê±Æ÷1¸´Î»º¯Êý
void time1reset(void)
{
	TH1=0;
	TL1=0;
	count1=0;
}



//time0ÖÐ¶Ï
void time0stop() interrupt 1
{
	count0++;//ÖÐ¶ÏÒ»´ÎÒç³ö´ÎÊý¼ÓÒ»
	TH0=0;
	TL0=0;//ÖØÐÂ¸³³õÖµ,TH,TL=0;
}



//time1ÖÐ¶Ï
void time1stop() interrupt 3
{
	count1++;
	TH1=0;
	TL1=0;
}



//Íâ²¿ÖÐ¶ÏINT0
void int0() interrupt 0
{
		state1=1;//ºìÍâÄ£¿é1½ÓÊÕµ½ÐÅºÅ
		TR0=1;//¼ÆÊ±Æ÷0¿ªÊ¼
		led11=led12=0;//Ö¸Ê¾µÆÁÁ		
}



//Íâ²¿ÖÐ¶ÏINT1
void int1() interrupt 2
{
	if(state1==1)//Èç¹ûÄ£¿é1ÒÑ¾­ÓÐÎïÌåÍ¨¹ý£¬²Å¼ÌÐøÖ´ÐÐ£¬·ñÔò²»ÏìÓ¦
	{
		state2=1;
		TR0=0;//time0 stop
		TR1=1;//time1 begin
		time0=(count0*65536+TH0*256+TL0);	//µ¥Î»us
		led11=led12=1;
		led21=led22=0;
	}
	else
	{
		led21=led22=1;
	}	
}



//----------------------------------------------------------------------------------------------------------------------------
//Ö÷º¯Êý
//----------------------------------------------------------------------------------------------------------------------------


main()
{
	
	uchar str[10];
	float v1=0.0,v2=0.0,v=0.0;
	
	
	//¶¨Ê±Æ÷³õÊ¼»¯
	time0initial();
	time1initial();
	
	//INT0³õÊ¼»¯
	int0initial();
	
	//INT1³õÊ¼»¯
	int1initial();
	
	//LCDÆÁ³õÊ¼»¯
	lcdinitial();
	
	
	while(1)
	{
				
		if(key3==0&&state2==1)//µ±Ç°Á½¸öÄ£¿é¶¼ÓÐÎïÌå¾­¹ý£¬ÇÒÄ£¿é3¸ÐÓ¦µ½ÎïÌåÊ±Ö´ÐÐ
		{
			state3=1;
			TR1=0;//¼ÆÊ±Æ÷1½áÊø
			time1=(count1*65536+TH1*256+TL1);
			led21=led22=1;
			led31=led32=0;	
		}
		else
		{
			led31=led32=1;
		}


	
		if(state3==1)
		{
			
			led11=led12=1;
			led21=led22=1;
			
			v1=L/time0;
			v2=L/time1;
			
			v=(float)(v1+v2)*1000000/2.0;
			

			//¸¡µãÊý×ª×Ö·û´®
			sprintf(str,"%f",v);
			
			lcddisplay(0,0,"Average Velocity");
			lcddisplay(0,1,str);
			lcddisplay(12,1,"cm/s");
			
			if(v>=60.0)
			{
				beep=0;
				delay(500);
				beep=1;
			}
			
			state1=state2=state3=0;
			
			time0reset();
			time1reset();
		}
	}			
}

